import random

def get_random_numbers(start=0, end=62):
    
    # 使用random.sample从区间中随机选择4个不重复的数字
    random1 = random.sample(range(start, end + 1), 4)
    a = random1[0]
    b = random1[1]
    c = random1[2]
    d = random1[3]
    zblist = ["喷射背包", "补给背包", "护卫犬漫游车", "防护罩生成包",
              "护卫犬", "机枪", "反器材步枪", "盟友", "消耗性反坦克武器", 
              "无后座力步枪", "火焰喷射器", "机炮", "重机枪", 
              "磁轨炮", "飞矛", "榴弹发射器", "激光大炮", "电弧发射器", 
              "类星体加农炮", "爱国者外骨骼装甲", "重机枪部署支架", 
              "防护罩生成中继器", "特斯拉塔", "反步兵雷区", "燃烧地雷", 
              "哨戒机枪", "加特林哨戒机枪", "迫击哨戒炮", "自动哨戒炮", 
              "火箭哨戒炮", "电磁冲击波哨戒炮", "轨道加特林火力网", 
              "轨道空爆攻击", "轨道120高爆弹火力网", "轨道380高爆弹火力网", 
              "轨道游走火力网", "轨道激光炮", "轨道炮攻击", "轨道精确攻击", 
              "轨道毒气攻击", "轨道电磁冲击波攻击", "轨道烟雾攻击", 
              "飞鹰机枪扫射", "飞鹰空袭", "飞鹰集束炸弹", "飞鹰凝固汽油弹空袭", 
              "飞鹰烟雾攻击", "飞鹰110MM火箭巢", "飞鹰500KG炸弹", 
              "轨道凝固汽油火力网", "反坦克地雷", "突击兵", "解放者外骨骼装甲", 
              "灭菌器", "空爆火箭弹发射器", "护卫犬腐息", "定向护盾", "WASP发射器", 
              "快速侦察载具", "火焰喷射哨戒炮", "反坦克炮台", "地狱火背包","悬浮背包"]
    jg = [zblist[a], zblist[b], zblist[c], zblist[d]]
    return jg
    
    
    